<?php
/*-------------------------------------------------------
*
*   Topic Up.
*   Copyright © 2012 Alexei Lukin
*
*--------------------------------------------------------
*
*   Official site: http://kerbystudio.ru
*   Contact e-mail: kerby@kerbystudio.ru
*
---------------------------------------------------------
*/


return array(
    'link_title'=>'Поднять топик',
    'link_text'=>'[^^^]',
    'notice_upped'=>'Топик поднят',

    'err_min_up_period'=>'Этот топик недавно поднимался',
    'err_min_user_rating'=>'Недостаточно рейтинга пользователя, чтобы поднять топик. Требуется %%rating%%.',
    'err_min_topic_rating'=>'Недостаточно рейтинга топика, чтобы быть поднятым. Требуется %%rating%%.',
    'err_max_count_per_period'=>'Превышено число возможных поднятий топиков за период.',
);
?>