<?php
/*-------------------------------------------------------
*
*   Topic Up.
*   Copyright © 2012 Alexei Lukin
*
*--------------------------------------------------------
*
*   Official site: http://kerbystudio.ru
*   Contact e-mail: kerby@kerbystudio.ru
*
---------------------------------------------------------
*/


$config=array();

// Минимальный период в секундах, который должен пройти, прежде, чем можно снова поднять топик
$config['min_up_period']=60*60*24; // 60*60*24=сутки

// Минимальный рейтинг пользователя, чтобы иметь возможность поднимать топики
$config['min_user_rating']=0; 

// Минимальный рейтинг топика, чтобы иметь возможность быть поднятым
$config['min_topic_rating']=0;

// Массив списка логинов пользователей, которым позволяется всегда поднимать топики
$config['super_uppers']=array('admin');

// Какое количество топиков может "поднять" пользователь за период
$config['max_count_per_period']=3;

return $config;
?>
